### Select duplicate rows, which occurrence last based on all columns

In [1]:
import pandas as pd 
df_employee = [('John', 3400, 'Sydeny'),
            ('Robert', 3000, 'Chicago'),
            ('Aadi', 1600, 'New York'),
            ('Robert', 3000, 'Chicago'),
            ('Robert', 3000, 'Chicago'),
            ('Robert', 3000, 'Texas'),
            ('Aadi', 4000, 'London'),
            ('Sachin', 3000, 'Chicago')
            ]
 
# Create a DataFrame object
df_employee = pd.DataFrame(df_employee, columns=['Name', 'Salary', 'City'])

df_employee

     Name  Salary      City
0    John    3400    Sydeny
1  Robert    3000   Chicago
2    Aadi    1600  New York
3  Robert    3000   Chicago
4  Robert    3000   Chicago
5  Robert    3000     Texas
6    Aadi    4000    London
7  Sachin    3000   Chicago

In [19]:
# Write the code here:

df=df_employee[df_employee.duplicated()]
store=list((df['Name']))
print(store[-1])

Robert